"""
Задача 1: Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
"""

a = input("Введите ваше имя: ")
b = int(input("Введите ваш возраст: "))
c = float(input("Введите число: "))
print(a, b, c)